Store/src/Documents/ПоступлениеТовара/ПоступлениеТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТовара</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Store/src/Documents/ПоступлениеТовара/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстДляПользователя = "Изменилось количество";
	
	ПересчитатьСуммуСтроки(ТекстДляПользователя, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстДляПользователя = "Изменилась цена";
	
	ПересчитатьСуммуСтроки(ТекстДляПользователя, ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПересчитатьСуммуСтроки(ТекстСообщения, Строка)
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = ТекстСообщения;
    Сообщение.Сообщить();
	
	
	Пользователь = ОписаниеСотрудника();
	Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = Пользователь.Имя;
    Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеСотрудника()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("СтажЛет", 15);
	Человек.Вставить("Штатный", Истина);
	Человек.Вставить("ДатаРождения", ТекущаяДата());
	
	Возврат Человек;
	
КонецФункции

#КонецОбласти
